Revit 2026 API

# ExportUtilsGetExportId(Document, ElementId) Method

---

Retrieves the GUID representing this element in DWF and IFC export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Guid GetExportId(
	Document document,
	ElementId elementId
)
```
```vb
Public Shared Function GetExportId (
	document As Document,
	elementId As ElementId
) As Guid
```
```cpp
public:
static Guid GetExportId(
	Document^ document,
	ElementId^ elementId
)
```
```fsharp
static member GetExportId :
        document : Document *
        elementId : ElementId -> Guid
```

#### Parameters

document Document
     The document.
elementId ElementId
     The id of the element.

#### Return Value

Guid The value of the GUID representing the element in the export context.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This id is used in the contents of DWF export and IFC export and it should be used only when cross-referencing to the contents of these export formats. When storing Ids that will need to be mapped back to elements in future sessions, UniqueId must be used.

#### Reference

ExportUtils Class

GetExportId Overload

Autodesk.Revit.DB Namespace